weifengdq/embedded/tc364/0_Empty_Project/Libraries/Infra/Sfr/TC36x/IfxDom_bf.h
/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI8 */
#define IFX_DOM_TIDEN_ENSCI8_OFF (8u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI9 */
#define IFX_DOM_TIDEN_ENSCI9_OFF (9u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI10 */
#define IFX_DOM_TIDEN_ENSCI10_OFF (10u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI11 */
#define IFX_DOM_TIDEN_ENSCI11_OFF (11u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI12 */
#define IFX_DOM_TIDEN_ENSCI12_OFF (12u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI13 */
#define IFX_DOM_TIDEN_ENSCI13_OFF (13u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI14 */
#define IFX_DOM_TIDEN_ENSCI14_OFF (14u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENSCI15 */
#define IFX_DOM_TIDEN_ENSCI15_OFF (15u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI0 */
#define IFX_DOM_TIDEN_ENMCI0_OFF (16u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI1 */
#define IFX_DOM_TIDEN_ENMCI1_OFF (17u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI2 */
#define IFX_DOM_TIDEN_ENMCI2_OFF (18u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI3 */
#define IFX_DOM_TIDEN_ENMCI3_OFF (19u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI4 */
#define IFX_DOM_TIDEN_ENMCI4_OFF (20u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI5 */
#define IFX_DOM_TIDEN_ENMCI5_OFF (21u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI6 */
#define IFX_DOM_TIDEN_ENMCI6_OFF (22u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI7 */
#define IFX_DOM_TIDEN_ENMCI7_OFF (23u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI8 */
#define IFX_DOM_TIDEN_ENMCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI8 */
#define IFX_DOM_TIDEN_ENMCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI8 */
#define IFX_DOM_TIDEN_ENMCI8_OFF (24u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI9 */
#define IFX_DOM_TIDEN_ENMCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI9 */
#define IFX_DOM_TIDEN_ENMCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI9 */
#define IFX_DOM_TIDEN_ENMCI9_OFF (25u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI10 */
#define IFX_DOM_TIDEN_ENMCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI10 */
#define IFX_DOM_TIDEN_ENMCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI10 */
#define IFX_DOM_TIDEN_ENMCI10_OFF (26u)

/** \brief Length for Ifx_DOM_TIDEN_Bits.ENMCI11 */
#define IFX_DOM_TIDEN_ENMCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDEN_Bits.ENMCI11 */
#define IFX_DOM_TIDEN_ENMCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDEN_Bits.ENMCI11 */
#define IFX_DOM_TIDEN_ENMCI11_OFF (27u)

/** \brief Length for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_LEN (1u)

/** \brief Mask for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_MSK (0x1u)

/** \brief Offset for Ifx_DOM_BRCON_Bits.OLDAEN */
#define IFX_DOM_BRCON_OLDAEN_OFF (0u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_ACCEN0_Bits.EN0 */
#define IFX_DOM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_DOM_ACCEN0_Bits.EN1 */
#define IFX_DOM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_DOM_ACCEN0_Bits.EN1 */
#define IFX_DOM_ACCEN0_EN1_MSK (0x1u)

